W11/W11D4/Todos/ToDo/app/controllers/api/todos_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Todo.find(params[:id])

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "title" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["title", "newAlpha"], ["updated_at", "2021-09-16 22:18:35.114427"], ["id", 1]]
---
  def update
    @todo = Todo.find_by(id: params[:id])
    if @todo.update(todo_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 1]]
---
  def destroy
    @todo = Todo.find_by(id: params[:id])

    if @todo.destroy